Revit 2024 API
DesignToFabricationConverter.GetConvertedFabricationPartsWithInvalidConnections Method
 Gets the collection of converted fabrication parts with invalid connections.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IDictionary<ElementId, ElementId> GetConvertedFabricationPartsWithInvalidConnections()
Visual Basic
Public Function GetConvertedFabricationPartsWithInvalidConnections As IDictionary(Of ElementId, ElementId)
Visual C++
public:
IDictionary<ElementId^, ElementId^>^ GetConvertedFabricationPartsWithInvalidConnections()
Remarks
 This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace